3s1d/fanet-stm32/Src/fanet/radio/sx1272.c

#include <stdlib.h>
#include <stdbool.h>
#include <stdio.h>
#include "main.h"
#include "stm32l4xx.h"
#include "stm32l4xx_hal_gpio.h"
#include "stm32l4xx_hal_spi.h"

#include "../radio/sx1272.h"

#ifdef SX1272_DO_FSK
#include <math.h>
#endif

bool sx1272_armed = false;
sx_region_t sx1272_region = {.channel = 0, .dBm = 0};
irq_callback sx1272_irq_cb = NULL;
SPI_HandleTypeDef *sx1272_spi = NULL;
uint32_t sx1272_last_tx_ticks = 0;
float sx_dutycycle = 0.0f;
float sx_airtime = 0.0f;

#ifdef SX1272_DO_FSK
#define SX_REG_BACKUP_POR	0
#define SX_REG_BACKUP_LORA	1
uint8_t sx_reg_backup[2][111];
#endif

/*
 * private
 */

void sx_select()
{
	HAL_NVIC_DisableIRQ(SXDIO0_EXTI8_EXTI_IRQn);
	HAL_GPIO_WritePin(SXSEL_GPIO_Port, SXSEL_Pin, GPIO_PIN_RESET);
}

void sx_unselect()
{
	HAL_GPIO_WritePin(SXSEL_GPIO_Port, SXSEL_Pin, GPIO_PIN_SET);
	HAL_NVIC_EnableIRQ(SXDIO0_EXTI8_EXTI_IRQn);
}

uint8_t sx_readRegister(uint8_t address)
{
	if(sx1272_spi == NULL)
		return 0;

	sx_select();

	/* bit 7 cleared to read in registers */
	address &= 0x7F;

	HAL_SPI_Transmit(sx1272_spi, &address, 1, 100);
	uint8_t value;
	HAL_SPI_Receive(sx1272_spi, &value, 1, 100);
	sx_unselect();

#if (SX1272_debug_mode > 1)
	printf("## SX1272 read reg(%02X)=%02X\n", address, value);
#endif
	return value;
}

void sx_writeRegister(uint8_t address, uint8_t data)
{
	sx_select();
	/* bit 7 set to write registers */
	address |= 0x80;

	uint8_t tx[2] = {address, data};
	HAL_SPI_Transmit(sx1272_spi, tx, 2, 100);
	sx_unselect();

#if (SX1272_debug_mode > 1)
	printf("## SX1272 write reg(%02X)=%02X\n", address, value);
#endif
}

uint8_t sx_readRegister_burst(uint8_t address, uint8_t *data, int length)
{
	if(sx1272_spi == NULL || data == NULL)
		return 0;

	sx_select();

	/* bit 7 cleared to read in registers */
	address &= 0x7F;

	HAL_SPI_Transmit(sx1272_spi, &address, 1, 100);
	HAL_StatusTypeDef ret = HAL_SPI_Receive(sx1272_spi, data, length, 100);
	sx_unselect();

	return (ret==HAL_OK)?length:0;
}

int sx_writeRegister_burst(uint8_t address, uint8_t *data, int length)
{
	if(sx1272_spi == NULL || data == NULL)
		return 0;

	sx_select();
	/* bit 7 set to write registers */
	address |= 0x80;

	HAL_SPI_Transmit(sx1272_spi, &address, 1, 100);
	HAL_StatusTypeDef ret = HAL_SPI_Transmit(sx1272_spi, data, length, 100);
	sx_unselect();

	return (ret==HAL_OK)?length:0;
}

bool sx_setOpMode(uint8_t mode)
{
#if (SX1272_debug_mode > 0)
	switch (mode)
	{
	case LORA_RXCONT_MODE:
		printf("## SX1272 opmode: rx continous\n");
	break;
	case LORA_TX_MODE:
		printf("## SX1272 opmode: tx\n");
	break;
	case LORA_SLEEP_MODE:
		printf("## SX1272 opmode: sleep\n");
	break;
	case LORA_STANDBY_MODE:
		printf("## SX1272 opmode: standby\n");
	break;
	case LORA_CAD_MODE:
		printf("## SX1272 opmode: cad\n");
	break;
	default:
		printf("## SX1272 opmode: unknown\n");
	}
#endif

	/* set mode */
	sx_writeRegister(REG_OP_MODE, mode);

	/* set rf analog end */
	switch (mode)
	{
	case LORA_RXSINGLE_MODE:
	case LORA_RXCONT_MODE:
	case LORA_CAD_MODE:
#ifdef SXTX_Pin
		HAL_GPIO_WritePin(SXTX_GPIO_Port, SXTX_Pin, GPIO_PIN_RESET);
#endif
#ifdef SXRX_Pin
		HAL_GPIO_WritePin(SXRX_GPIO_Port, SXRX_Pin, GPIO_PIN_SET);
#endif
	break;
	case LORA_TX_MODE:
	case GFSK_TX_MODE:
#ifdef SXRX_Pin
		HAL_GPIO_WritePin(SXRX_GPIO_Port, SXRX_Pin, GPIO_PIN_RESET);
#endif
#ifdef SXTX_Pin
		HAL_GPIO_WritePin(SXTX_GPIO_Port, SXTX_Pin, GPIO_PIN_SET);
#endif
	break;
	default:
#ifdef SXTX_Pin
		HAL_GPIO_WritePin(SXTX_GPIO_Port, SXTX_Pin, GPIO_PIN_RESET);
#endif
#ifdef SXRX_Pin
		HAL_GPIO_WritePin(SXRX_GPIO_Port, SXRX_Pin, GPIO_PIN_RESET);
#endif
		break;
	}

	/* wait for frequency synthesis, 10ms timeout */
	uint8_t opmode = 0;
	for(int i=0; i<10 && opmode != mode; i++)
	{
		HAL_Delay(1);
		opmode = sx_readRegister(REG_OP_MODE);
	}

#if (SX1272_debug_mode > 1)
	printf("## SX1272 opmode: %02X\n", opmode);
#endif

	return mode == opmode;
}

uint8_t sx_getOpMode(void)
{
	return sx_readRegister(REG_OP_MODE);
}

int sx_writeFifo(uint8_t addr, uint8_t *data, int length)
{
	/* select location */
	sx_writeRegister(REG_FIFO_ADDR_PTR, addr);

	/* write data */
	return sx_writeRegister_burst(REG_FIFO, data, length);
}

int sx_readFifo(uint8_t addr, uint8_t *data, int length)
{
	/* select location */
	sx_writeRegister(REG_FIFO_ADDR_PTR, addr);

	/* read data */
	return sx_readRegister_burst(REG_FIFO, data, length);
}

void sx_setDio0Irq(int mode)
{
	uint8_t map1 = sx_readRegister(REG_DIO_MAPPING1) & 0x3F;
	sx_writeRegister(REG_DIO_MAPPING1, map1 | mode);
}

float sx_expectedAirTime_ms(void)
{
#ifdef SX1272_DO_FSK
	uint8_t mode = sx_getOpMode();
	if(SX_IN_FSK_MODE(mode))
	{
		/* FSK */
		//note: fixed length, no address, ignoring CRC (as it's done in software here)
		int nbytes = ((sx_readRegister(REG_PREAMBLE_MSB_FSK) << 8) | sx_readRegister(REG_PREAMBLE_LSB_FSK)) +	//preamble
				(sx_readRegister(REG_SYNC_CONFIG)&SYNCSIZE_MASK_FSK) + 1 +				//syncword
				sx_readRegister(REG_PAYLOAD_LENGTH_FSK) * (sx_readRegister(REG_PACKET_CONFIG1)&0x20?2:1);//payload, assuming <256
		int bitrate = (sx_readRegister(REG_BITRATE_MSB)<<8) | sx_readRegister(REG_BITRATE_LSB);
		if(bitrate <= 0)
			bitrate = 100;
		bitrate = 32e6 / bitrate;

		float air_time = (8.0f * nbytes) / bitrate * 1e3;
		return air_time;

	}
#endif
	/* LORA */
        float bw = 0.0f;
        uint8_t cfg1 = sx_readRegister(REG_MODEM_CONFIG1);
        uint8_t bw_reg = cfg1 & 0xC0;
        switch( bw_reg )
        {
        case 0:		// 125 kHz
            bw = 125000.0f;
            break;
        case 0x40: 	// 250 kHz
            bw = 250000.0f;
            break;
        case 0x80: 	// 500 kHz
            bw = 500000.0f;
            break;
        }

        // Symbol rate : time for one symbol (secs)
        uint8_t sf_reg = sx_readRegister(REG_MODEM_CONFIG2)>>4;
        //float sf = sf_reg<6 ? 6.0f : sf_reg;
        float rs = bw / ( 1 << sf_reg );
        float ts = 1 / rs;
        // time of preamble
        float tPreamble = ( sx_readRegister(REG_PREAMBLE_LSB_LORA) + 4.25f ) * ts;		//note: assuming preamble < 256
        // Symbol length of payload and time
        int pktlen = sx_readRegister(REG_PAYLOAD_LENGTH_LORA);					//note: assuming CRC on -> 16, fixed length
        int coderate = (cfg1 >> 3) & 0x7;
        float tmp = ceil( (8 * pktlen - 4 * sf_reg + 28 + 16 - 20) / (float)( 4 * ( sf_reg ) ) ) * ( coderate + 4 );
        float nPayload = 8 + ( ( tmp > 0 ) ? tmp : 0 );
        float tPayload = nPayload * ts;
        // Time on air
        float tOnAir = (tPreamble + tPayload) * 1000.0f;

        return tOnAir;
}

bool sx_receiveStart(void)
{
#if (SX1272_debug_mode > 0)
	printf("## SX1272 receive start\n");
#endif

	sx_setOpMode(LORA_STANDBY_MODE);

	/* prepare receiving */
	sx_writeRegister(REG_FIFO_RX_BASE_ADDR, 0x00);
	sx_writeRegister(REG_PAYLOAD_LENGTH_LORA, 0xFF);		//is this evaluated in explicit mode?

	/* clear any rx done flag */
	sx_writeRegister(REG_IRQ_FLAGS, IRQ_RX_DONE);

	/* switch irq behavior to rx_done and enter rx cont mode */
	sx_setDio0Irq(DIO0_RX_DONE_LORA);
	return sx_setOpMode(LORA_RXCONT_MODE);
}

int sx_channel_free4tx(bool doCAD)
{
	uint8_t mode = sx_getOpMode();
	if(SX_IN_FSK_MODE(mode))
		return TX_FSK_ONGOING;
	mode &= LORA_MODE_MASK;

