3s1d/fanet-stm32/Src/fanet/radio/sx1272.c
	/* are we transmitting anyway? */
	if(mode == LORA_TX_MODE)
		return TX_TX_ONGOING;

	/* in case of receiving, is it ongoing? */
	for(int i=0; i<4 && (mode == LORA_RXCONT_MODE || mode == LORA_RXSINGLE_MODE); i++)
	{
		if(sx_readRegister(REG_MODEM_STAT) & 0x0B)
			return TX_RX_ONGOING;
		HAL_Delay(1);
	}

	/* CAD not required */
	if(doCAD == false)
		return TX_OK;

	/*
	 * CAD
	 */

	sx_setOpMode(LORA_STANDBY_MODE);
	sx_writeRegister(REG_IRQ_FLAGS, IRQ_CAD_DONE | IRQ_CAD_DETECTED);	/* clearing flags */
	sx_setOpMode(LORA_CAD_MODE);

	/* wait for CAD completion */
//TODO: it may enter a life lock here...
	uint8_t iflags;
	while(((iflags=sx_readRegister(REG_IRQ_FLAGS)) & IRQ_CAD_DONE) == 0)
		HAL_Delay(1);

	if(iflags & IRQ_CAD_DETECTED)
	{
		/* re-establish old mode */
		if(mode == LORA_RXCONT_MODE || mode == LORA_RXSINGLE_MODE || mode == LORA_SLEEP_MODE)
			sx_setOpMode(mode);

		return TX_RX_ONGOING;
	}

	return TX_OK;
}


/*
 * public
 */


bool sx1272_init(SPI_HandleTypeDef *spi)
{
#if (SX1272_debug_mode > 1)
	printf("## SX1272 begin\n");
#endif

	sx1272_spi = spi;

	/* Pins */
	//note: are assumed to be configured
	sx_unselect();

	/* Configure SPI */
	//note: spi configured in spi.c

	/* Reset pulse for LoRa module initialization */
	HAL_GPIO_WritePin(SXRESET_GPIO_Port, SXRESET_Pin, GPIO_PIN_SET);
	HAL_Delay(2);
	HAL_GPIO_WritePin(SXRESET_GPIO_Port, SXRESET_Pin, GPIO_PIN_RESET);
	HAL_Delay(7);

#ifdef SX1272_DO_FSK
	/* get POR registers */
	//note: required for FSK transition, storing is faster than performing a reset
	sx_readRegister_burst(REG_BITRATE_MSB, sx_reg_backup[SX_REG_BACKUP_POR], sizeof(sx_reg_backup[SX_REG_BACKUP_POR]));
#endif
	/* set Lora mode, this is only possible during sleep -> do it twice */
	sx_setOpMode(LORA_SLEEP_MODE);
	sx_setOpMode(LORA_SLEEP_MODE);

	/* set standby mode */
	bool mode = sx_setOpMode(LORA_STANDBY_MODE);

	/* some more tweaks here */
	/* disable LowPnTxPllOff -> low phase noise PLL in transmit mode, however more current */
	sx_writeRegister(REG_PA_RAMP, 0x09);
	/* disable over current detection */
	sx_writeRegister(REG_OCP, 0x1B);

	return mode;
}
void sx1272_setBandwidth(uint8_t bw)
{
#if (SX1272_debug_mode > 0)
	printf("## SX1272 BW:%02X\n", bw;
#endif

	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(LORA_STANDBY_MODE);

	uint8_t config1 = sx_readRegister(REG_MODEM_CONFIG1);
	config1 = (bw&BW_MASK) | (config1&~BW_MASK);
	if(bw == BW_125)
	{
		uint8_t sf = sx1272_getSpreadingFactor();
		if(sf == SF_11 || sf == SF_12)
			sx1272_setLowDataRateOptimize(true);
	}
	sx_writeRegister(REG_MODEM_CONFIG1, config1);

	/* restore state */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(opmode);
}

uint8_t sx1272_getBandwidth(void)
{
	uint8_t bw = sx_readRegister(REG_MODEM_CONFIG1) & BW_MASK;

#if (SX1272_debug_mode > 0)
	printf("## SX1272 BW=%02X\n", bw;
#endif

	return bw;
}

void sx1272_setLowDataRateOptimize(bool ldro)
{
#if (SX1272_debug_mode > 0)
	printf("## SX1272 LDRO:%d\n", !!ldro);
#endif

	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(LORA_STANDBY_MODE);

	uint8_t config1 = sx_readRegister(REG_MODEM_CONFIG1);
	config1 = (config1&0xFE) | !!ldro;
	sx_writeRegister(REG_MODEM_CONFIG1, config1);

	/* restore state */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(opmode);
}

void sx1272_setPayloadCrc(bool crc)
{
#if (SX1272_debug_mode > 0)
	printf("## SX1272 CRC:%d\n", !!crc);
#endif

	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(LORA_STANDBY_MODE);

	uint8_t config1 = sx_readRegister(REG_MODEM_CONFIG1);
	config1 = (config1&0xFD) | !!crc<<1;
	sx_writeRegister(REG_MODEM_CONFIG1, config1);

	/* restore state */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(opmode);
}

void sx1272_setSpreadingFactor(uint8_t spr)
{
#if (SX1272_debug_mode > 0)
	printf("## SX1272 SF:%02X\n", spr);
#endif

	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(LORA_STANDBY_MODE);

	uint8_t config2 = sx_readRegister(REG_MODEM_CONFIG2);
	config2 = (spr&SF_MASK) | (config2&~SF_MASK);

	/* LowDataRateOptimize (Mandatory with SF_11 or SF_12 if BW_125) */
	if((spr == SF_11 || spr == SF_12) && sx1272_getBandwidth() == BW_125)
		sx1272_setLowDataRateOptimize(true);

	sx_writeRegister(REG_MODEM_CONFIG2, config2);

	/* Check if it is necessary to set special settings for SF=6 */
	if (spr == SF_6)
	{
		// Mandatory headerOFF with SF = 6 (Implicit mode)
		sx1272_setExplicitHeader(false);
		sx_writeRegister(REG_DETECT_OPTIMIZE, 0x05);
		sx_writeRegister(REG_DETECTION_THRESHOLD, 0x0C);
	}
	else
	{
		sx_writeRegister(REG_DETECT_OPTIMIZE, 0x03);
		sx_writeRegister(REG_DETECTION_THRESHOLD, 0x0A);
	}

	/* restore state */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(opmode);
}

uint8_t sx1272_getSpreadingFactor(void)
{
	uint8_t sf = sx_readRegister(REG_MODEM_CONFIG2) & SF_MASK;

#if (SX1272_debug_mode > 0)
	printf("## SX1272 SF=%02X\n", sf);
#endif

	return sf;
}

bool sx1272_setCodingRate(uint8_t cr)
{
#if (SX1272_debug_mode > 0)
	printf("## SX1272 CR:%02X\n", cr);
#endif

	/* store state */
	uint8_t opmode = sx_getOpMode();
	if(opmode == LORA_TX_MODE)
		return false;

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE && !sx_setOpMode(LORA_STANDBY_MODE))
		return false;

	uint8_t config1 = sx_readRegister(REG_MODEM_CONFIG1);
	config1 = (cr&CR_MASK) | (config1&~CR_MASK);
	sx_writeRegister(REG_MODEM_CONFIG1, config1);

	/* restore state */
	if(opmode != LORA_STANDBY_MODE)
		return sx_setOpMode(opmode);
	else
		return true;
}

uint8_t sx1272_getCodingRate(void)
{
	uint8_t cr = sx_readRegister(REG_MODEM_CONFIG1) & CR_MASK;

#if (SX1272_debug_mode > 0)
	printf("## SX1272 CR=%02X\n", cr);
#endif

	return cr;
}

bool sx1272_setChannel(uint32_t ch)
{
#if (SX1272_debug_mode > 0)
	printf("## SX1272 CH:%02X\n", ch);
#endif

	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(LORA_STANDBY_MODE);

	uint8_t freq3 = (ch >> 16) & 0x0FF;		// frequency channel MSB
	uint8_t freq2 = (ch >> 8) & 0xFF;		// frequency channel MID
	uint8_t freq1 = ch & 0xFF;			// frequency channel LSB

