3s1d/fanet-stm32/Src/fanet/radio/sx1272.c
	sx_writeRegister(REG_FRF_MSB, freq3);
	sx_writeRegister(REG_FRF_MID, freq2);
	sx_writeRegister(REG_FRF_LSB, freq1);

	/* restore state */
	bool ret = true;
	if(opmode != LORA_STANDBY_MODE)
		ret = sx_setOpMode(opmode);

	return ret;
}

uint32_t sx1272_getChannel(void)
{
	uint8_t freq3 = sx_readRegister(REG_FRF_MSB);	// frequency channel MSB
	uint8_t freq2 = sx_readRegister(REG_FRF_MID);	// frequency channel MID
	uint8_t freq1 = sx_readRegister(REG_FRF_LSB);	// frequency channel LSB
	uint32_t ch = ((uint32_t) freq3 << 16) + ((uint32_t) freq2 << 8) + (uint32_t) freq1;

#if (SX1272_debug_mode > 0)
	printf("## SX1272 CH=%02X\n", ch);
#endif

	return ch;
}

void sx1272_setExplicitHeader(bool exhdr)
{
#if (SX1272_debug_mode > 0)
	printf("## SX1272 explicit header:%d\n", exhdr);
#endif

	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(LORA_STANDBY_MODE);

	/* bit2: 0->explicit 1->implicit */
	uint8_t config1 = sx_readRegister(REG_MODEM_CONFIG1);
	config1 = (config1&0xFB) | !exhdr<<2;
	sx_writeRegister(REG_MODEM_CONFIG1, config1);

	/* restore state */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(opmode);
}

void sx1272_setLnaGain(uint8_t gain, bool lnaboost)
{
	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(LORA_STANDBY_MODE);

#if (SX1272_debug_mode > 0)
	printf("## SX1272 lna gain:%d\n", (gain<<LNAGAIN_OFFSET) | (lnaboost?0x3:0x0);
#endif
	sx_writeRegister(REG_LNA, (gain<<LNAGAIN_OFFSET) | (lnaboost?0x3:0x0));

	/* restore state */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(opmode);
}

//note: we currently only support PA_BOOST
bool sx1272_setPower(int pwr)
{
	/* clamp pwr requirement */
	if(pwr < 2)
		pwr = 2;
	if(pwr > 20)
		pwr = 20;

#if (SX1272_debug_mode > 0)
	printf("## SX1272 dBm:%d\n", pwr);
#endif

	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(LORA_STANDBY_MODE);

	if(pwr >= 18)
	{
		/* high power mode */
		sx_writeRegister(REG_PA_DAC, PA_DAC_HIGH_PWR);
		pwr -= 5;
	}
	else
	{
		/* normal mode */
		sx_writeRegister(REG_PA_DAC, PA_DAC_DEFAULT_PWR);
		pwr -= 2;
	}

	/* PA output pin to PA_BOOST */
	sx_writeRegister(REG_PA_CONFIG, 0x80 | pwr);

	/* restore state */
	if(opmode != LORA_STANDBY_MODE)
		return sx_setOpMode(opmode);
	else
		return true;
}

bool sx1272_setArmed(bool mode)
{
	if(mode == sx1272_armed)
		return true;

	/* transmit packet in buffer */
	while(sx_getOpMode() == LORA_TX_MODE)
		HAL_Delay(1);

	if(sx1272_irq_cb != NULL)
		HAL_NVIC_DisableIRQ(SXDIO0_EXTI8_EXTI_IRQn);

	/* store mode */
	uint8_t opmode = sx_getOpMode();

	/* update state */
	sx1272_armed = mode;

	if(mode)
	{
		/* enable rx */
#ifdef SX1272_DO_FSK
		if(opmode != LORA_TX_MODE && opmode != GFSK_TX_MODE)
#else
		if(opmode != LORA_TX_MODE)
#endif
			sx_receiveStart();
	}
	else
	{
		/* enter power save */
		sx_setOpMode(LORA_SLEEP_MODE);
	}

	if(sx1272_irq_cb != NULL)
		HAL_NVIC_EnableIRQ(SXDIO0_EXTI8_EXTI_IRQn);

	return true;
}

bool sx1272_isArmed(void)
{
	return sx1272_armed;
}

//note: do not use hardware based interrupts here
void sx1272_irq(void)
{
#if (SX1272_debug_mode > 1)
		printf("## SX1272 irq: \n");
#endif

	/* enter sleep mode */
	//note: does not destroy MSB (LORA <-> FSK)
	sx_setOpMode(LORA_STANDBY_MODE);

#ifdef SX1272_DO_FSK
	if(!(sx_getOpMode()&0x80))
	{
#if (SX1272_debug_mode > 1)
		printf("FSK\n");
#endif
		/* FSK mode -> enter normal mode again */
		//note: we currently only support TX on FSK
		sx_setOpMode(GFSK_SLEEP_MODE);
		sx_setOpMode(LORA_SLEEP_MODE);
		sx_writeRegister_burst(REG_BITRATE_MSB, sx_reg_backup[SX_REG_BACKUP_LORA], sizeof(sx_reg_backup[SX_REG_BACKUP_LORA]));

		/* switch irq behavior back and re-enter rx mode */
		if(sx1272_armed)
			sx_receiveStart();
		return;
	}
#endif

	if(sx1272_irq_cb == NULL)
	{
#if (SX1272_debug_mode > 1)
		printf("## No callback. Error\n");
#endif

		sx_writeRegister(REG_IRQ_FLAGS, 0xFF);
		return;
	}

	uint8_t what = sx_readRegister(REG_IRQ_FLAGS);
#if (SX1272_debug_mode > 1)
	printf("%02x\n", what);
#endif
	/* Tx done */
	//if(what & IRQ_TX_DONE)
	//{
		//nothing to do...
	//}

	/* Rx done, CRC is valid and CRC was transmitted */
	if((what & IRQ_RX_DONE) && !(what & IRQ_PAYLOAD_CRC_ERROR) && (sx_readRegister(REG_HOP_CHANNEL) & CRC_ON_PAYLOAD))
	{
		/* retrieve data */
		const int received = sx_readRegister(REG_RX_NB_BYTES);

		/* callback function which is supposed to read the fifo */
		if(received > 0 && sx1272_irq_cb != NULL)
			sx1272_irq_cb(received);
	}

	/* clear all flag */
	sx_writeRegister(REG_IRQ_FLAGS, 0xFF);

	/* switch irq behavior back and re-enter rx mode */
	if(sx1272_armed)
		sx_receiveStart();
}


void sx1272_setIrqReceiver(irq_callback cb)
{
	sx_setOpMode(LORA_STANDBY_MODE);
	sx_setDio0Irq(DIO0_RX_DONE_LORA);

	/* clear all flag */
	sx_writeRegister(REG_IRQ_FLAGS, 0xFF);

	sx1272_irq_cb = cb;
	HAL_NVIC_EnableIRQ(SXDIO0_EXTI8_EXTI_IRQn);
}

void sx1272_clrIrqReceiver(void)
{
	sx_setOpMode(LORA_STANDBY_MODE);

	HAL_NVIC_DisableIRQ(SXDIO0_EXTI8_EXTI_IRQn);
	sx1272_irq_cb = NULL;
}

bool sx1272_setRegion(sx_region_t region)
{
	bool success = sx1272_setChannel(region.channel) && sx1272_setPower(region.dBm);

	if(success)
		sx1272_region = region;

	return success;
}

void sx1272_setSyncWord(uint8_t sw)
{
	sx_writeRegister(REG_SYNCWORD_LORA, sw);
}

int sx1272_getRssi(void)
{
	/* get values */
	const int pktsnr = (int8_t) sx_readRegister(REG_PKT_SNR_VALUE);
	int rssi = -139 + sx_readRegister(REG_PKT_RSSI_VALUE);
	if(pktsnr < 0)
		rssi += ((pktsnr-2)/4);			//note: correct rounding for negative numbers

	return rssi;
}

/***********************************/
int sx1272_sendFrame(uint8_t *data, int length, uint8_t cr)
{
#if (SX1272_debug_mode > 0)
	printf("## SX1272 send frame...");
#endif

	/* channel accessible? */
	int state = sx_channel_free4tx(true);
	if(state != TX_OK)
		return state;

